## Plan Result (shared-snowplow-consumer-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11804528387)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 3 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-consumequeue-dlq-alarm
  * aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-topics-dlq-alarm
  * aws_sqs_queue.shared-event-consumer-dlq
* Update
  * aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114
  * aws_sqs_queue.shared-event-consumer
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy
* Delete
  * aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-dlq-alarm



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)
      + version       = "2012-10-17"

      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ",
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
            ]
        }
    }

  # data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "shared-snowplow-consumer-sns-sqs-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                  + "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "sns.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-consumequeue-dlq-alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "sharedsnowplowconsumer-prod-consumequeue-dlq-alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + alarm_description                     = "Number of messages >= 15"
      + alarm_name                            = "SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-ConsumeQueue-Dlq-Alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + period                                = 900
      + statistic                             = "Sum"
      + tags_all                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "SharedSnowplowConsumer"
        }
      + threshold                             = 15
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-dlq-alarm will be destroyed
  # (because aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-dlq-alarm is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "sharedsnowplowconsumer-prod-dlq-alarm" {
      - actions_enabled                       = true -> null
      - alarm_actions                         = [
          - "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ] -> null
      - alarm_description                     = "Number of messages >= 15" -> null
      - alarm_name                            = "SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-Dlq-Alarm" -> null
      - arn                                   = "arn:aws:cloudwatch:us-east-1:996905175585:alarm:SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-Dlq-Alarm" -> null
      - comparison_operator                   = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {
          - "QueueName" = "SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
        } -> null
      - evaluation_periods                    = 2 -> null
      - id                                    = "SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-Dlq-Alarm" -> null
      - insufficient_data_actions             = [] -> null
      - metric_name                           = "ApproximateNumberOfMessagesVisible" -> null
      - namespace                             = "AWS/SQS" -> null
      - ok_actions                            = [
          - "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ] -> null
      - period                                = 900 -> null
      - statistic                             = "Sum" -> null
      - tags                                  = {} -> null
      - tags_all                              = {
          - "app_code"       = "pocket-content-shared"
          - "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          - "costCenter"     = "Shared"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "SharedSnowplowConsumer"
        } -> null
      - threshold                             = 15 -> null
      - treat_missing_data                    = "notBreaching" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-topics-dlq-alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "sharedsnowplowconsumer-prod-topics-dlq-alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + alarm_description                     = "Number of messages >= 15"
      + alarm_name                            = "SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-Topics-Dlq-Alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + period                                = 900
      + statistic                             = "Sum"
      + tags_all                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "SharedSnowplowConsumer"
        }
      + threshold                             = 15
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114 will be updated in-place
  ~ resource "aws_iam_policy" "shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114" {
        id               = "arn:aws:iam::996905175585:policy/SharedSnowplowConsumer-Prod-TaskRolePolicy"
        name             = "SharedSnowplowConsumer-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue",
                          - "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "SharedSnowplowConsumer"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.shared-event-consumer will be updated in-place
  ~ resource "aws_sqs_queue" "shared-event-consumer" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
        name                              = "SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + redrive_policy                    = (known after apply)
        tags                              = {
            "app_code"       = "pocket-content-shared"
            "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
            "costCenter"     = "Shared"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "SharedSnowplowConsumer"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_sqs_queue.shared-event-consumer-dlq will be created
  + resource "aws_sqs_queue" "shared-event-consumer-dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "SharedSnowplowConsumer"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-sharedsnowplowconsumer"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "SharedSnowplowConsumer"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sqs:SendMessage"
                      - Condition = {
                          - ArnLike = {
                              - "aws:SourceArn" = [
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic",
                                  - "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "sns.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":923,"Program":"tfcmt","SHA1":"abad31b21f687817b065dfdaaeb0365a15cd3e97","Target":"shared-snowplow-consumer-cdk-production","Vars":{},"WorkflowName":"Shared Snowplow Consumer"} -->